In [43]:
import pandas as pd
df= pd.read_csv("E:/s1.csv")
df

  student_id  math_marks  science_marks
0       s001          85             78
1       s002          90             88
2       s003          75             82
3       s004          80             79

In [44]:
df1= pd.read_csv("E:/s2.csv")
df1

  student_id    Name Department
0       s001     Anu         CS
1       s002    Ravi        ECE
2       s003   Meena        CSE
3       s004  Kirana       MECH

In [46]:
df_merged=pd.merge(df,df1,on='student_id', how='inner')

In [40]:
df_merged

  Student_id  Name_x Department_x  Name_y Department_y
0       s001     Anu           CS     Anu           CS
1       s002    Ravi          ECE    Ravi          ECE
2       s003   Meena          CSE   Meena          CSE
3       s004  Kirana         MECH  Kirana         MECH